In [91]:
import cx_Oracle as o
#define a connection string (User, password, DSN)
con = o.connect('GLquery','try2balance','MISC')
#to check connection is working
con.version

'11.2.0.4.0'

In [92]:
# make a sql cursor and use it to call a query
cur = con.cursor()
fd = open('pennyskuswebvisible.sql', 'r')
sqlFile = fd.read()
fd.close()

In [93]:
cur.execute(sqlFile)
# fetch the first row of the query
row = cur.fetchall()
#show the datatype of the row
type(row)
#it's a tuple. Let's print it
#print(row)

list

In [94]:
#dataframes can be made from lists of tuples, here is a list of one tuple

#now we make a dataframe out of it
import pandas as pd
df = pd.DataFrame(row)

In [95]:
#here's our dataframe
df

        0                     1    2                   3                   4
0  UY7349               JIA GAO  200 2017-08-24 13:51:32 2017-08-24 13:50:42
1  UY7352               JIA GAO  200 2017-08-24 13:55:45 2017-08-24 13:55:09
2  UY7360               JIA GAO  100 2017-08-24 14:26:17 2017-08-24 14:25:54
3  UY7360               JIA GAO  200 2017-08-24 14:26:17 2017-08-24 14:25:54
4  UY7459  DAVID CESARE LAVALLE  100 2017-08-24 19:30:21 2017-08-24 19:29:54
5  UY7460  DAVID CESARE LAVALLE  100 2017-08-24 19:33:05 2017-08-24 19:32:45

In [96]:
# Get our headers for our query
stuff = cur.description
dfhead= [x[0] for x in stuff]
dfhead= tuple(dfhead)

In [97]:
# make our headers tuple into a a list of tuples (so we can make it into a dataframe)
dfhead = [dfhead]
dfhead

[('ITEM', 'cre_user name', 'IMVDIV', 'MOD_DATE', 'CRE_DATE')]

In [98]:
dfhead = pd.DataFrame(dfhead)

In [99]:
#concatenate frames and ignore the index
frames = [dfhead, df]
completedf = pd.concat(frames, ignore_index=True)
completedf

,0,1,2,3,4
0,ITEM,cre_user name,IMVDIV,MOD_DATE,CRE_DATE
1,UY7349,JIA GAO,200,2017-08-24 13:51:32,2017-08-24 13:50:42
2,UY7352,JIA GAO,200,2017-08-24 13:55:45,2017-08-24 13:55:09
3,UY7360,JIA GAO,100,2017-08-24 14:26:17,2017-08-24 14:25:54
4,UY7360,JIA GAO,200,2017-08-24 14:26:17,2017-08-24 14:25:54
5,UY7459,DAVID CESARE LAVALLE,100,2017-08-24 19:30:21,2017-08-24 19:29:54
6,UY7460,DAVID CESARE LAVALLE,100,2017-08-24 19:33:05,2017-08-24 19:32:45

In [100]:
#make header out of first row and get rid of first row
completedf.columns = completedf.iloc[0]
completedf.drop(0, inplace = True)
completedf

,ITEM,cre_user name,IMVDIV,MOD_DATE,CRE_DATE
1,UY7349,JIA GAO,200,2017-08-24 13:51:32,2017-08-24 13:50:42
2,UY7352,JIA GAO,200,2017-08-24 13:55:45,2017-08-24 13:55:09
3,UY7360,JIA GAO,100,2017-08-24 14:26:17,2017-08-24 14:25:54
4,UY7360,JIA GAO,200,2017-08-24 14:26:17,2017-08-24 14:25:54
5,UY7459,DAVID CESARE LAVALLE,100,2017-08-24 19:30:21,2017-08-24 19:29:54
6,UY7460,DAVID CESARE LAVALLE,100,2017-08-24 19:33:05,2017-08-24 19:32:45

In [101]:
thing = completedf.to_html('df.html')
#thing2 = completedf.to_csv('df.csv')

In [102]:
############## Make HTML out of it
#close your cursor
cur.close()
#close your connection (very important!)
con.close()

In [103]:
import codecs
M_sMessage = codecs.open('df.html','r')
M_sMessage = M_sMessage.read()
#M_sMessage

In [104]:
import os
import sys
import smtplib
from email.mime.multipart import MIMEMultipart
from email.mime.text import MIMEText
from email.mime.base import MIMEBase
from email import encoders
import time

In [ ]:
me = "margu@Softchoice.com"
you = "margu@softchoice.com"

msg = MIMEMultipart()
msg['Subject'] = "Penny Skus"
msg['From'] = me
msg['To'] = you

def job():
    text = "Here's your penny skus that are web visible for today"
    #text = "Here's your error report"
    L_sMessage =(text + "\n\n\n\n" + M_sMessage)

    part1 = MIMEText(L_sMessage, 'html')
    #part2 = MIMEBase('application', "octet-stream")
    #part2.set_payload(open('df.csv', 'w').read())
    #encoders.encode_base64(part2)

    msg.attach(part1)
    #msg.attach(part2)
    msg.attach


    s = smtplib.SMTP('mail.softchoice.com')
    s.sendmail(me, you, msg.as_string())
    s.quit()
    time.sleep(60)

variable = 0
while variable < 3:
    job()
    variable = variable + 1

1503669381.2488582
From print_time 1503669386.2495368 default
From print_time 1503669391.2496238 default
1503669391.2496238